Config/Documents/ПакетыДанныхДляМСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПакетыДанныхДляМСД</Name>
			<Comment>Пакеты передаваемых данных в модуль сбора данных</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияТаксономии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПередаваемыхДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтвержденияТаксономии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичнаяВыгрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевыгрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОстатковИОборотов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеМО</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеДляПересчетаОстатков</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/СведенияОСрокахПредоставленияДанныхМСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СведенияОСрокахПредоставленияДанныхМСД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелФОИВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыМСД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ПериодичностьМСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПериодичностьМСД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДевятьМесяцев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйПериод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ПакетыДанныхДляМСД/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	ПараметрыРазмещения = МодульПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КомандыФормы;
	МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	История.Параметры.УстановитьЗначениеПараметра("Пакет", Неопределено);
	ИнициализироватьЛегендуСостояний(); 
	
	ЗаполнитьПараметрыМесяц(); 
	УстановитьОтборыФормы();
				
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФормаСроковПредоставления = ПолучитьФорму("РегистрСведений.СведенияОСрокахПредоставленияДанныхМСД.Форма.ФормаСроков");
	Если НЕ ФормаСроковПредоставления.Открыта() Тогда
		ПолучитьУведомлениеПользователя();
		ПодключитьОбработчикОжидания("ПолучитьУведомлениеПользователя", 60);  
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы 

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)  
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	История.Параметры.УстановитьЗначениеПараметра("Пакет", ТекущиеДанные.Ссылка);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОткрытьФайлыПакета(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ОткрытьФорму("Документ.ПакетыДанныхДляМСД.Форма.ФормаПодписиФайлов", Новый Структура("Пакет", ТекущиеДанные.Ссылка), ЭтотОбъект);	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ИнициализироватьЛегендуСостояний()
	
	КартинкаСформирован = 0;
	КартинкаОтправлен = 1;
	КартинкаВОчереди = 2;	
	КартинкаЗагружен = 3;
	КартинкаНеПринят = 5; 
	КартинкаОжидание = 6; 
	КартинкаНетДанных = 7;

КонецПроцедуры	

&НаСервере
Функция ПолучитьУведомлениеПользователяНаСервере()
	Возврат МодульСбораДанных.УведомлениеПользователя();
КонецФункции  

&НаКлиенте
Процедура ОткрытиеОповещения(ДополнительныеПараметры) Экспорт
 	ОткрытьФорму("РегистрСведений.СведенияОСрокахПредоставленияДанныхМСД.Форма.ФормаСроков");
КонецПроцедуры 

&НаКлиенте
Процедура ПолучитьУведомлениеПользователя()
	
	МассивРезультат = ПолучитьУведомлениеПользователяНаСервере(); 
	
	Для каждого СтрокаМассива Из МассивРезультат Цикл
		ВыводитьОповещение = Истина;
		Если НЕ ХранилищеСравненияОповещений.НайтиПоЗначению(СтрокаМассива.ИдентификаторСтроки) = Неопределено Тогда
			ВыводитьОповещение = Ложь;	
		КонецЕсли;	
		
		Если ВыводитьОповещение = Истина Тогда
			Описание = Новый ОписаниеОповещения("ОткрытиеОповещения", ЭтотОбъект);	
			ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru='Отчетный период: %1'"), СтрокаМассива.ПериодДанных),
									      Описание,
			                              СтрокаМассива.Результат,
									      БиблиотекаКартинок.Оповещения,
									      СтатусОповещенияПользователя.Важное,
								          СтрокаМассива.ПериодДанных);
			ХранилищеСравненияОповещений.Добавить(СтрокаМассива.ИдентификаторСтроки);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьПараметрыМесяц()
	
	Список.Параметры.УстановитьЗначениеПараметра("Январь", НСтр("ru='Январь'", ОбщегоНазначения.КодОсновногоЯзыка())); 
	Список.Параметры.УстановитьЗначениеПараметра("Февраль", НСтр("ru='Февраль'", ОбщегоНазначения.КодОсновногоЯзыка()));
	Список.Параметры.УстановитьЗначениеПараметра("Март", НСтр("ru='Март'", ОбщегоНазначения.КодОсновногоЯзыка()));
	Список.Параметры.УстановитьЗначениеПараметра("Апрель", НСтр("ru='Апрель'", ОбщегоНазначения.КодОсновногоЯзыка()));
	Список.Параметры.УстановитьЗначениеПараметра("Май", НСтр("ru='Май'", ОбщегоНазначения.КодОсновногоЯзыка()));
	Список.Параметры.УстановитьЗначениеПараметра("Июнь", НСтр("ru='Июнь'", ОбщегоНазначения.КодОсновногоЯзыка()));
	Список.Параметры.УстановитьЗначениеПараметра("Июль", НСтр("ru='Июль'", ОбщегоНазначения.КодОсновногоЯзыка()));
	Список.Параметры.УстановитьЗначениеПараметра("Август", НСтр("ru='Август'", ОбщегоНазначения.КодОсновногоЯзыка()));
	Список.Параметры.УстановитьЗначениеПараметра("Сентябрь", НСтр("ru='Сентябрь'", ОбщегоНазначения.КодОсновногоЯзыка()));
	Список.Параметры.УстановитьЗначениеПараметра("Октябрь", НСтр("ru='Октябрь'", ОбщегоНазначения.КодОсновногоЯзыка()));
	Список.Параметры.УстановитьЗначениеПараметра("Ноябрь", НСтр("ru='Ноябрь'", ОбщегоНазначения.КодОсновногоЯзыка()));
	Список.Параметры.УстановитьЗначениеПараметра("Декабрь", НСтр("ru='Декабрь'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьОтборыФормы()

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "ПометкаУдаления",
	ВидСравненияКомпоновкиДанных.Равно, Ложь, "СкрыватьПометкуУдаленияПоУмолчанию", Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "Организация",
	ВидСравненияКомпоновкиДанных.Равно, ОтборОрганизация, "ОтборОрганизация", Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);  
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "Статус",
	ВидСравненияКомпоновкиДанных.Равно, ОтборСтатус, "ОтборСтатус", Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный); 
	
	ГруппаЭлементовОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор, "ГруппаЭлементовОтбора", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
 
	НачалоПериода = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаЭлементовОтбора, "НачалоПериода",
	ВидСравненияКомпоновкиДанных.Равно, Дата(1,1,1), "ОтборНачалоПериода", Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный); 
	
	ОкончаниеПериода = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаЭлементовОтбора, "ОкончаниеПериода",
	ВидСравненияКомпоновкиДанных.Равно, Дата(1,1,1), "ОтборОкончаниеПериода", Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный); 
	
	ВидПередаваемыхДанных = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаЭлементовОтбора, "ВидПередаваемыхДанных",
	ВидСравненияКомпоновкиДанных.Равно, Ложь, "ОтборВидПередаваемыхДанных", Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
КонецПроцедуры 

&НаКлиенте
Процедура ПоказыватьПомеченные(Команда)	
	Элементы.ФормаПоказыватьПомеченные.Пометка = Не Элементы.ФормаПоказыватьПомеченные.Пометка;
	ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(Список.Отбор, "ПометкаУдаления",
		"СкрыватьПометкуУдаленияПоУмолчанию", Ложь, ВидСравненияКомпоновкиДанных.Равно,
		Не Элементы.ФормаПоказыватьПомеченные.Пометка, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(Список.Отбор, "Организация",
		"ОтборОрганизация", ОтборОрганизация, ВидСравненияКомпоновкиДанных.Равно,
		ЗначениеЗаполнено(ОтборОрганизация), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
КонецПроцедуры

&НаСервере
Процедура ОтборПериодПриИзмененииНаСервере()
	ЗначенияРеквизитовОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОтборПериод, "ДатаНачала, ДатаОкончания, Периодичность"); 
	
	ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(Список.Отбор, "НачалоПериода",
		"ОтборНачалоПериода", НачалоДня(?(ЗначениеЗаполнено(ЗначенияРеквизитовОбъекта.ДатаНачала), ЗначенияРеквизитовОбъекта.ДатаНачала, Дата(1,1,1))), ВидСравненияКомпоновкиДанных.Равно,
		ЗначениеЗаполнено(ЗначенияРеквизитовОбъекта.ДатаНачала), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(Список.Отбор, "ОкончаниеПериода",
		"ОтборОкончаниеПериода", КонецДня(?(ЗначениеЗаполнено(ЗначенияРеквизитовОбъекта.ДатаОкончания), ЗначенияРеквизитовОбъекта.ДатаОкончания, Дата(1,1,1))), ВидСравненияКомпоновкиДанных.Равно,
		ЗначениеЗаполнено(ЗначенияРеквизитовОбъекта.ДатаОкончания), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(Список.Отбор, "ВидПередаваемыхДанных",
		"ОтборВидПередаваемыхДанных", (ЗначенияРеквизитовОбъекта.Периодичность = Перечисления.ПериодичностьМСД.Месяц) , ВидСравненияКомпоновкиДанных.Равно,
		ЗначениеЗаполнено(ЗначенияРеквизитовОбъекта.Периодичность), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодПриИзменении(Элемент)
	ОтборПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(Список.Отбор, "Статус",
		"ОтборСтатус", ОтборСтатус, ВидСравненияКомпоновкиДанных.Равно,
		ЗначениеЗаполнено(ОтборСтатус), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
КонецПроцедуры

#КонецОбласти
